---

# Pandas - Lab 5 Task 1
---

### Abhiraj Chaudhuri
### 22000214
### BCA - Batch A
---

## 1. Create 3 lists - viz. productId, productName, productPrice with 5 elements each. Add this element to create a DataFrame.

In [79]:
import numpy as np
import pandas as pd

In [83]:
l1 = [114,115,116,169,181]
l2 = ['Mango', 'Banana', 'Strawberry', 'Pineapple', 'Orange']
l3 = [100,40,75,89,50]

In [85]:
df = pd.DataFrame(
    zip(l1,l2,l3), 
    columns = ["Product ID", "Product Name", "Product Price"], 
    index = [i for i in range(1,6)]
)
df

   Product ID Product Name  Product Price
1         114        Mango            100
2         115       Banana             40
3         116   Strawberry             75
4         169    Pineapple             89
5         181       Orange             50

## 2. Extract one by one column and display separately from above df.

In [86]:
print(df['Product ID'],'\n')
print(df['Product Name'],'\n')
print(df['Product Price'],'\n')

1    114
2    115
3    116
4    169
5    181
Name: Product ID, dtype: int64

1         Mango
2        Banana
3    Strawberry
4     Pineapple
5        Orange
Name: Product Name, dtype: object

1    100
2     40
3     75
4     89
5     50
Name: Product Price, dtype: int64

## 3. Display separately each and every row from an above df (use loc or iloc)

In [87]:
print(df[:1],'\n')
print(df[1:2],'\n')
print(df[2:3],'\n')
print(df[3:4],'\n')
print(df[4:5],'\n')

   Product ID Product Name  Product Price
1         114        Mango            100

   Product ID Product Name  Product Price
2         115       Banana             40

   Product ID Product Name  Product Price
3         116   Strawberry             75

   Product ID Product Name  Product Price
4         169    Pineapple             89

   Product ID Product Name  Product Price
5         181       Orange             50

In [88]:
print(df.loc[1],'\n')
print(df.loc[2],'\n')
print(df.loc[3],'\n')
print(df.loc[4],'\n')
print(df.loc[5],'\n')

Product ID         114
Product Name     Mango
Product Price      100
Name: 1, dtype: object

Product ID          115
Product Name     Banana
Product Price        40
Name: 2, dtype: object

Product ID              116
Product Name     Strawberry
Product Price            75
Name: 3, dtype: object

Product ID             169
Product Name     Pineapple
Product Price           89
Name: 4, dtype: object

Product ID          181
Product Name     Orange
Product Price        50
Name: 5, dtype: object

## 4. Display data name from 3 row using loc function

In [89]:
df.loc[3:6,['Product Name']]

  Product Name
3   Strawberry
4    Pineapple
5       Orange

## 5. Display price located in 2 row using iloc function

In [90]:
df.iloc[2,2]

75

## 6. Display 2nd to 4th row data excluding price.

In [91]:
df.iloc[1:4, 0:2]

   Product ID Product Name
2         115       Banana
3         116   Strawberry
4         169    Pineapple

## 7. Display 1 to 3rd row price data only.

In [92]:
df.iloc[0:3, df.columns.get_loc('Product Price')]

1    100
2     40
3     75
Name: Product Price, dtype: int64

## New DataFrame

In [93]:
data = {
    'Name': ['Abhie', 'Abhishek', 'Ajin', 'Parita', 'Rohan', 'Sandra', 'Riya'],
    'Maths': np.random.randint(30, 100, 7),
    'Science': np.random.randint(30, 100, 7),
    'English': np.random.randint(30, 100, 7),
}
dff = pd.DataFrame(data)
dff

       Name  Maths  Science  English
0     Abhie     62       79       84
1  Abhishek     49       66       80
2      Ajin     61       93       49
3    Parita     85       31       60
4     Rohan     98       95       56
5    Sandra     64       55       64
6      Riya     42       73       54

## 8. Change marks in Maths column to 41 for students who have scored less than 40.

In [94]:
dff['Maths'].where(dff['Maths'] >= 40, 41)

0    62
1    49
2    61
3    85
4    98
5    64
6    42
Name: Maths, dtype: int64

## 9. Add 2 marks to all the subjects marks. If any of the marks exceeds 100 change it to 100.

In [95]:
subjects = ['Maths', 'Science', 'English']
for i in subjects:
    dff[i] = dff[i].apply(lambda x: min(x + 2, 100))
dff

       Name  Maths  Science  English
0     Abhie     64       81       86
1  Abhishek     51       68       82
2      Ajin     63       95       51
3    Parita     87       33       62
4     Rohan    100       97       58
5    Sandra     66       57       66
6      Riya     44       75       56

## 10. Display students who have scored more than 50 marks in Maths and more than 60 marks in Science.

In [96]:
dff[(dff['Maths'] > 50) & (dff['Science'] > 60)]

       Name  Maths  Science  English
0     Abhie     64       81       86
1  Abhishek     51       68       82
2      Ajin     63       95       51
4     Rohan    100       97       58

## 11. Display students records whose name starts with letter S.

In [97]:
dff[dff['Name'].str.startswith('S')]

     Name  Maths  Science  English
5  Sandra     66       57       66

## 12. Display students records whose name ends with letter a.

In [98]:
dff[dff['Name'].str.endswith('a')]

     Name  Maths  Science  English
3  Parita     87       33       62
5  Sandra     66       57       66
6    Riya     44       75       56

## 13. Calculate total and percentage for all the students.

In [99]:
dff['Total'] = dff[subjects].sum(axis=1)
dff['Percentage'] = dff['Total'] / 300 * 100
dff

       Name  Maths  Science  English  Total  Percentage
0     Abhie     64       81       86    231   77.000000
1  Abhishek     51       68       82    201   67.000000
2      Ajin     63       95       51    209   69.666667
3    Parita     87       33       62    182   60.666667
4     Rohan    100       97       58    255   85.000000
5    Sandra     66       57       66    189   63.000000
6      Riya     44       75       56    175   58.333333

## 14. Calculate Status (PASS / FAIL) for the Students.

In [100]:
['PASS' if marks >= 200 else 'FAIL' for marks in dff['Total']]

['PASS', 'PASS', 'PASS', 'FAIL', 'PASS', 'FAIL', 'FAIL']

## 15. Calculate percentage based grade value:
###    per>=90 then A-grade, 
###    per>=80 then B-grade, 
###   per>=70 then C-grade, 
###    per>=60 then D-grade, 
###    per>=50 then E-grade, 
###    per<50 then F-grade

In [101]:
dff.loc[dff['Percentage']<=49.9,'Grade']='F'
dff.loc[dff['Percentage']>49.9,'Grade']='E'
dff.loc[dff['Percentage']>59.9,'Grade']='D'
dff.loc[dff['Percentage']>69.9,'Grade']='C'
dff.loc[dff['Percentage']>79.9,'Grade']='B'
dff.loc[dff['Percentage']>89.9,'Grade']='A'

In [102]:
dff['Grade'] = dff['Percentage'].apply(lambda x: 'A' if x > 89.9 else ('B' if x > 79.9 else ('C' if x > 69.9 else ('D' if x > 59.9 else ('E' if x > 49.9 else 'F')))))

In [103]:
dff

       Name  Maths  Science  English  Total  Percentage Grade
0     Abhie     64       81       86    231   77.000000     C
1  Abhishek     51       68       82    201   67.000000     D
2      Ajin     63       95       51    209   69.666667     D
3    Parita     87       33       62    182   60.666667     D
4     Rohan    100       97       58    255   85.000000     B
5    Sandra     66       57       66    189   63.000000     D
6      Riya     44       75       56    175   58.333333     E

## 16. Also calculate overall columns total, maximum, minimum and standard deviation for each numeric columns

In [104]:
mathSum = sum(dff['Maths'])
sciSum = sum(dff['Science'])
engSum = sum(dff['English'])
totSum = sum(dff['Total'])
perSum = sum(dff['Percentage'])

print("Maths Total: ",mathSum,"\nScience Total: ", sciSum,"\nEnglish Total: ", engSum,"\nTotal: ", totSum,"\nPercentage Total: ", perSum)
dff.describe()

Maths Total:  475
Science Total:  506
English Total:  461
Total:  1442
Percentage Total:  480.6666666666667

            Maths    Science    English       Total  Percentage
count    7.000000   7.000000   7.000000    7.000000    7.000000
mean    67.857143  72.285714  65.857143  206.000000   68.666667
std     19.556999  22.380902  13.296974   28.536526    9.512175
min     44.000000  33.000000  51.000000  175.000000   58.333333
25%     57.000000  62.500000  57.000000  185.500000   61.833333
50%     64.000000  75.000000  62.000000  201.000000   67.000000
75%     76.500000  88.000000  74.000000  220.000000   73.333333
max    100.000000  97.000000  86.000000  255.000000   85.000000

## 16.5 Convert the above dataframe to excel, Json and html.

In [105]:
dff.to_csv('lab5_1.csv')
dff.to_json('lab5_1.json')
# dff.to_sql('pandu.sql', engine)
dff.to_excel('lab5_1.xlsx')
dff.to_html('lab5_1.html')

### 17. Display meta-data for each column for the above dataframe.

In [106]:
dff.describe()

            Maths    Science    English       Total  Percentage
count    7.000000   7.000000   7.000000    7.000000    7.000000
mean    67.857143  72.285714  65.857143  206.000000   68.666667
std     19.556999  22.380902  13.296974   28.536526    9.512175
min     44.000000  33.000000  51.000000  175.000000   58.333333
25%     57.000000  62.500000  57.000000  185.500000   61.833333
50%     64.000000  75.000000  62.000000  201.000000   67.000000
75%     76.500000  88.000000  74.000000  220.000000   73.333333
max    100.000000  97.000000  86.000000  255.000000   85.000000

### 18. Convert the above DataFrame to list within a dictionary.

In [109]:
dff.to_dict(orient='list')

{'Name': ['Abhie', 'Abhishek', 'Ajin', 'Parita', 'Rohan', 'Sandra', 'Riya'],
 'Maths': [64, 51, 63, 87, 100, 66, 44],
 'Science': [81, 68, 95, 33, 97, 57, 75],
 'English': [86, 82, 51, 62, 58, 66, 56],
 'Total': [231, 201, 209, 182, 255, 189, 175],
 'Percentage': [77.0,
  67.0,
  69.66666666666667,
  60.66666666666667,
  85.0,
  63.0,
  58.333333333333336],
 'Grade': ['C', 'D', 'D', 'D', 'B', 'D', 'E']}

### 19. Convert this dictionary again to a separate dataframe by adding 500 to each element in product price column

In [111]:
df['Product Price']+=500
df

   Product ID Product Name  Product Price
1         114        Mango            600
2         115       Banana            540
3         116   Strawberry            575
4         169    Pineapple            589
5         181       Orange            550

---

# Task 2

## Preprocessing

In [51]:
import pandas as pd

In [52]:
sal = pd.read_csv('datasets/Salaries.csv', low_memory = False)

In [53]:
sal

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.0,56120.71,198306.9,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737.0,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
148649,148650,Roy I Tillery,Custodian,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,PT
148650,148651,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148651,148652,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148652,148653,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.00,0.00,-618.13,0.00,-618.13,-618.13,2014,NaN,San Francisco,PT

In [54]:
sal.describe()

                  Id       TotalPay  TotalPayBenefits           Year  Notes
count  148654.000000  148654.000000     148654.000000  148654.000000    0.0
mean    74327.500000   74768.321972      93692.554811    2012.522643    NaN
std     42912.857795   50517.005274      62793.533483       1.117538    NaN
min         1.000000    -618.130000       -618.130000    2011.000000    NaN
25%     37164.250000   36168.995000      44065.650000    2012.000000    NaN
50%     74327.500000   71426.610000      92404.090000    2013.000000    NaN
75%    111490.750000  105839.135000     132876.450000    2014.000000    NaN
max    148654.000000  567595.430000     567595.430000    2014.000000    NaN

In [55]:
sal.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.0,56120.71,198306.9,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737.0,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

In [56]:
sal.tail()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
148649,148650,Roy I Tillery,Custodian,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,PT
148650,148651,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148651,148652,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148652,148653,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.00,0.00,-618.13,0.00,-618.13,-618.13,2014,NaN,San Francisco,PT

In [57]:
sal.shape

(148654, 13)

In [58]:
sal.columns

Index(['Id', 'EmployeeName', 'JobTitle', 'BasePay', 'OvertimePay', 'OtherPay',
       'Benefits', 'TotalPay', 'TotalPayBenefits', 'Year', 'Notes', 'Agency',
       'Status'],
      dtype='object')

In [59]:
sal.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148049 non-null  object
 4   OvertimePay       148654 non-null  object
 5   OtherPay          148654 non-null  object
 6   Benefits          112495 non-null  object
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            38119 non-null   object
dtypes: float64(3), int64(2), object(8)
memory usage: 14.7+ MB

---
## Handling Missing Values
---
- `isnull()` - selects NaN or None
- `notnull()` - opposite 
- `dropna()` - removes entire row
    - `dropna(axis = 1)` - removes entire column
    - `dropna(thresh=2)` - removes data if data >= 2
- `fillna(value = 0)`
    - `fillna(df.marks.mean())`
    - `fillna(method = 'ffill')` - ffill - forward filling - previous value to NaN
    - `fillna(method = 'bfill')` - ffill - backward filling - next value to NaN
    - `fillna(method = 'pad')` -
- eg: `df.replace(toreplace = 'Not Provided', 'NaN')`
#### Interpolation - process of determining unknown data points between two known data points.

In [60]:
#fill nan with 0
sal = sal.fillna(0)

In [61]:
#convert non zero to 0
sal['OtherPay'] = sal['OtherPay'].replace('Not Provided', '0.00')
sal['BasePay'] = sal['BasePay'].replace('Not Provided', '0.00')
sal['OvertimePay'] = sal['OvertimePay'].replace('Not Provided', '0.00')
sal['Benefits'] = sal['Benefits'].replace('Not Provided', '0.00')
sal['OtherPay'] = sal['OtherPay'].astype(float)
sal['BasePay'] = sal['BasePay'].astype(float)
sal['OvertimePay'] = sal['OvertimePay'].astype(float)
sal['Benefits'] = sal['Benefits'].astype(float)

In [62]:
sal.dtypes

Id                    int64
EmployeeName         object
JobTitle             object
BasePay             float64
OvertimePay         float64
OtherPay            float64
Benefits            float64
TotalPay            float64
TotalPayBenefits    float64
Year                  int64
Notes               float64
Agency               object
Status               object
dtype: object

# Tasks

### 1. Import pandas as pd.

In [63]:
import pandas as pd

### 2. Read Salaries.cs as a dataframe called sal.

In [64]:
#sal69 = pd.read_csv('datasets/Salaries.csv', low_memory = False)

### 3. Check the head of the DataFrame.

In [65]:
sal.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,0.0,567595.43,567595.43,2011,0.0,San Francisco,0
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,0.0,538909.28,538909.28,2011,0.0,San Francisco,0
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,0.0,335279.91,335279.91,2011,0.0,San Francisco,0
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,0.0,332343.61,332343.61,2011,0.0,San Francisco,0
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,0.0,326373.19,326373.19,2011,0.0,San Francisco,0

### 4. Use the info() method to find out how many entries there are.

In [66]:
sal.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148654 non-null  float64
 4   OvertimePay       148654 non-null  float64
 5   OtherPay          148654 non-null  float64
 6   Benefits          148654 non-null  float64
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             148654 non-null  float64
 11  Agency            148654 non-null  object
 12  Status            148654 non-null  object
dtypes: float64(7), int64(2), object(4)
memory usage: 14.7+ MB

### 5. What is the average BasePay ?

In [67]:
sal['BasePay'].mean()

66053.72928807836

### 6. What is the highest amount of OvertimePay in the dataset ?

In [68]:
sal['OvertimePay'].max()

245131.88

### 7. What is the job title of JOSEPH DRISCOLL? Note: Use all caps, otherwise you may get an answer that doesn't match up (there is also a lowercase Joseph Driscoll).

In [69]:
sal[sal['EmployeeName']=='JOSEPH DRISCOLL']['JobTitle']

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

### 8. How much does JOSEPH DRISCOLL make (including benefits)?

In [70]:
print("Joseph Driscoll's Total Pay including benefits:",sum(sal[sal['EmployeeName']=='JOSEPH DRISCOLL']['TotalPayBenefits']))

Joseph Driscoll's Total Pay including benefits: 270324.91

### 9. What is the name of highest paid person (including benefits)?

In [71]:
sal[sal['TotalPayBenefits']==sal['TotalPayBenefits'].max()]['EmployeeName']

0    NATHANIEL FORD
Name: EmployeeName, dtype: object

### 10. What is the name of lowest paid person (including benefits)? Do you notice something strange about how much he or she is paid?

In [72]:
sal[sal['TotalPayBenefits']==sal['TotalPayBenefits'].min()]['EmployeeName']

148653    Joe Lopez
Name: EmployeeName, dtype: object

### 11. What was the average (mean) BasePay of all employees per year? (2011-2014) ?

In [73]:
sal.groupby('Year')['BasePay'].mean()

Year
2011    63595.956517
2012    65436.406857
2013    68509.832156
2014    66557.437750
Name: BasePay, dtype: float64

### 12. How many unique job titles are there?

In [74]:
sal['JobTitle'].nunique()

2159

### 13. What are the top 5 most common jobs?

In [75]:
jobTitleCount = sal['JobTitle'].value_counts()
jobTitleCount.nlargest(5)

JobTitle
Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: count, dtype: int64

### 14. How many Job Titles were represented by only one person in 2013? (e.g. Job Titles with only one occurence in 2013?)

In [76]:
sum(sal[sal['Year'] == 2013]['JobTitle'].value_counts() == 1)

202

### 15. How many people have the word Chief in their job title?

In [77]:
sal[sal['JobTitle'].str.contains("Chief")].shape[0]

423

In [78]:
sum(sal['JobTitle'].apply(lambda x: 'chief' in x.lower()))

627

### 16. Is there a correlation between length of the Job Title string and Salary?

No

---